In [1]:
import pandas as pd;

In [3]:
df1 = pd.DataFrame({'ID':[1,2,3], 'Score':[33,55,66]})
df1

   ID  Score
0   1     33
1   2     55
2   3     66

In [4]:
df2 = pd.DataFrame({'ID':[1,2,3,4], 'Score':[22,44,55,66]})
df2

   ID  Score
0   1     22
1   2     44
2   3     55
3   4     66

In [6]:
pd.concat([df1, df2], axis=0)

   ID  Score
0   1     33
1   2     55
2   3     66
0   1     22
1   2     44
2   3     55
3   4     66

In [7]:
pd.concat([df1,df2], axis=1)

    ID  Score  ID  Score
0  1.0   33.0   1     22
1  2.0   55.0   2     44
2  3.0   66.0   3     55
3  NaN    NaN   4     66

In [8]:
# Joins...........................

In [9]:
pd.merge(df1,df2, how='inner', on='ID')

   ID  Score_x  Score_y
0   1       33       22
1   2       55       44
2   3       66       55